Repository: guojipeng5034/stu-flu
Catalog: lib/l10n/arb/app_*.arb
Languages: ja, ko, ru, zh_hant

source: Passwords do not match. Please re-enter.
ja: パスワードが一致しません。再入力してください。
ko: 비밀번호가 일치하지 않습니다. 다시 입력해주세요.
ru: Пароли не совпадают. Повторите попытку.
zh_hant: 兩次密碼不一致，請重新輸入

# passwordMustIncludeLettersNumbersSpecialCharacters
source: Password must include letters, numbers, and special characters, and be 8–20 characters long
ja: パスワードは8～20文字で、英字・数字・記号を含める必要があります。
ko: 비밀번호는 문자, 숫자, 특수문자를 포함하고 8-20자여야 합니다.
ru: Пароль должен содержать буквы, цифры, спецсимволы и быть от 8 до 20 символов.
zh_hant: 密碼須包含字母、數字和特殊符號，長度8-20位

source: QR code has expired. Please scan again.
ja: QRコードの有効期限が切れています。再度スキャンしてください。
ko: QR 코드가 만료되었습니다. 다시 스캔해주세요.
ru: QR-код истёк. Отсканируйте снова.
zh_hant: QR code已失效，請重新掃描

# serverErrorPleaseRetryLater
source: Server error. Please try again later.
ja: サーバーエラーです。しばらくしてから再試行してください。
ko: 서버 오류입니다. 나중에 다시 시도해주세요.
ru: Ошибка сервера. Повторите попытку позже.
zh_hant: 服務器異常，請稍後再試

# pleaseCheckInternetConnectionOrRetryLater
source: Please check your internet connection or try again later.
ja: インターネット接続を確認するか、後でもう一度お試しください。
ko: 인터넷 연결을 확인하거나 나중에 다시 시도해주세요.
ru: Проверьте подключение к Интернету или повторите попытку позже.
zh_hant: 請檢查網路或稍後重試

# verificationCodeHasBeenSentPleaseCheckSMS
source: Verification code has been sent. Please check your SMS.
ja: 認証コードを送信しました。SMSをご確認ください。
ko: 인증 코드가 전송되었습니다. SMS를 확인해주세요.
ru: Код отправлен. Проверьте SMS
zh_hant: 驗證碼已發送，請查看簡訊

# verificationCodeHasBeenSentPleaseCheckEmail
source: Verification code has been sent. Please check your email.
ja: 認証コードを送信しました。メールをご確認ください。
ko: 인증 코드가 전송되었습니다. 이메일을 확인해주세요.
ru: Код отправлен. Проверьте почту
zh_hant: 驗證碼已發送，請查看郵件

# getFreeTrialClassWithForeignTeacher
source: Get a free trial class with a foreign teacher
ja: 無料体験レッスンを受け取りましょう。
ko: 외국인 교사와 무료 체험 수업 받기
ru: Получите пробный урок с иностранным преподавателем
zh_hant: 免費領取外籍老師試聽課

source: Already claimed
ja: 受け取り済み
ko: 이미 신청함
ru: Уже использовано
zh_hant: 已領取

source: Successfully claimed
ja: 受け取り成功
ko: 성공적으로 신청됨
ru: Успешно получено
zh_hant: 領取成功

source: Got it
ja: 確認しました
ko: 알겠습니다
ru: Понял(а)
zh_hant: 知道了

# congratulationsYouveSuccessfullyClaimedYourFreeTrialClass
source: Congratulations! You've successfully claimed your free trial class. Your dedicated class advisor will contact you by phone shortly—please make sure to answer the call.
ja: おめでとうございます！無料体験レッスンの受け取りが完了しました。 まもなく専任スタッフよりお電話いたしますので、ご対応をお願いいたします。
ko: 축하합니다! 무료 체험 수업을 성공적으로 신청하셨습니다. 전담 수업 상담사가 곧 전화로 연락드릴 예정이니 전화를 받아주세요.
ru: Поздравляем! Вы записались на пробный урок. Скоро с вами свяжется менеджер, пожалуйста, ответьте на звонок
zh_hant: 恭喜您成功領取免費試聽課，稍後客服人員將會聯繫您，請注意接聽喔

source: Registered email/ account
ja: 登録済みのメールアドレス／アカウント
ko: 등록된 이메일 / 계정
ru: Зарегистрированный email / аккаунт
zh_hant: 已註冊的郵箱／帳號

source: Please enter your name
ja: 名前を入力してください
ko: 이름을 입력해주세요
ru: Введите ваше имя
zh_hant: 請輸入姓名

source: Please enter your English name
ja: 英語の名前を入力してください
ko: 영어 이름을 입력해주세요
ru: Введите ваше имя на английском
zh_hant: 請輸入英文名字

source: Please select your birthday
ja: 誕生日を選択してください
ko: 생일을 선택해주세요
ru: Выберите дату рождения
zh_hant: 請選擇生日

source: Please select your gender
ja: 性別を選択してください
ko: 성별을 선택해주세요
ru: Выберите пол
zh_hant: 請選擇性別

source: Unlinked
ja: 未連携
ko: 연결되지 않음
ru: Не привязан
zh_hant: 未綁定

source: Confirm unlinking
ja: 連携を解除してもよろしいですか？
ko: 연결 해제 확인
ru: Подтвердите отвязку
zh_hant: 確認解除綁定

# afterUnbindingWeChatAccountYouWillNoLongerBeAbleToUseWeChat
source: After unbinding your WeChat account, you will no longer be able to use WeChat to log in to this CampusTop account.
ja: WeChatアカウントの連携を解除すると、このCampusTopアカウントにはWeChatでログインできなくなります。
ko: WeChat 계정 연결을 해제하면 더 이상 WeChat으로 이 CampusTop 계정에 로그인할 수 없습니다.
ru: После отвязки WeChat вы не сможете использовать его для входа в аккаунт CampusTop.
zh_hant: 解除綁定微信帳號後將無法繼續使用微信登入該 CampusTop 帳號

source: Unlink
ja: 連携解除
ko: 연결 해제
ru: Отвязать
zh_hant: 解除綁定

source: Successfully unlinked
ja: 連携解除に成功しました
ko: 성공적으로 연결 해제됨
ru: Успешно отвязано
zh_hant: 解除綁定成功

source: Account canceled
ja: アカウントは削除されています
ko: 계정이 취소됨
ru: Аккаунт удален
zh_hant: 已註銷

source: Your account has been canceled. Please contact customer service.
ja: このアカウントはすでに削除されています。カスタマーサポートまでお問い合わせください。
ko: 귀하의 계정이 취소되었습니다. 고객 서비스에 문의해주세요.
ru: Ваша учётная запись была удалена. Обратитесь в службу поддержки клиентов.
zh_hant: 帳號已註銷，請聯繫客服

source: Operation timed out. Please log out and log in again.
ja: 操作がタイムアウトしました。一度ログアウトしてから再度ログインしてください。
ko: 작업 시간이 초과되었습니다. 로그아웃 후 다시 로그인해주세요.
ru: Время ожидания операции истекло. Пожалуйста, выйдите из системы и войдите снова.
zh_hant: 操作過時，請退出後重新登錄

source: WeChat ID
zh_hant: 微信號
