Repository: guojipeng5034/stu-flu
Catalog: lib/l10n/arb/app_*.arb
Languages: ja, ko, ru, zh_hant

source: Hello World!
ja: こんにちは世界！
ko: 안녕하세요 세계!
ru: Привет мир!
zh_hant: 你好世界!

# welcomeMessage
source: Welcome to our app!
ja: 私たちのアプリへようこそ！
ko: 저희 앱에 오신 것을 환영합니다!
ru: Добро пожаловать в наше приложение!
zh_hant: 歡迎使用我們的應用！

# demoPageTitle
source: Localization Demo
ja: ローカライゼーションデモ
ko: 현지화 데모
ru: Демонстрация локализации
zh_hant: 本地化演示

# demoSectionTitle
source: Localization Examples
ja: ローカライゼーション例
ko: 현지화 예제
ru: Пример локализации
zh_hant: 本地化示例

# basicUsageTitle
source: Basic Usage
ja: 基本的な使用法
ko: 기본 사용법
ru: Основное использование
zh_hant: 基本用法

# languageSwitchTitle
source: Switch Language
ja: 言語切り替え
ko: 언어 전환
ru: Переключение языка
zh_hant: 切換語言

# serverTranslationTitle
source: Server Translation Status
ja: サーバー翻訳状態
ko: 서버 번역 상태
ru: Статус перевода сервера
zh_hant: 服務器翻譯狀態

source: Current Language
ja: 現在の言語
ko: 현재 언어
ru: Текущий язык
zh_hant: 當前語言

source: Refresh Translations
ja: 翻訳を更新
ko: 번역 새로고침
ru: Обновить переводы
zh_hant: 刷新翻譯

# refreshCompleted
source: Translations refreshed
ja: 翻訳が更新されました
ko: 번역이 새로고침되었습니다
ru: Переводы обновлены
zh_hant: 翻譯已刷新

source: Translation Error
ja: 翻訳エラー
ko: 번역 오류
ru: Ошибка перевода
zh_hant: 翻譯錯誤

source: Server translations loaded
ja: サーバー翻訳が読み込まれました
ko: 서버 번역이 로드되었습니다
ru: Переводы сервера загружены
zh_hant: 服務器翻譯已加載

# noServerTranslations
source: No server translations available
ja: 利用可能なサーバー翻訳がありません
ko: 사용 가능한 서버 번역이 없습니다
ru: Нет доступных переводов сервера
zh_hant: 沒有可用的服務器翻譯

# translationNotInitialized
source: Translations not initialized
ja: 翻訳が初期化されていません
ko: 번역이 초기화되지 않았습니다
ru: Перевод не инициализирован
zh_hant: 翻譯未初始化

# userProfileTitle
source: User Profile
ja: ユーザープロフィール
ko: 사용자 프로필
ru: Профиль пользователя
zh_hant: 用戶資料

# nameLabel
source: Name
ja: 名前
ko: 이름
ru: Имя
zh_hant: 姓名

# emailLabel
source: Email
ja: メールアドレス
ko: 이메일
ru: Электронная почта
zh_hant: 郵箱

# roleLabel
source: Role
ja: 役割
ko: 역할
ru: Роль
zh_hant: 角色

source: Update Profile
ja: プロフィールを更新
ko: 프로필 업데이트
ru: Обновить профиль
zh_hant: 更新資料

# profileUpdated
source: Profile updated successfully
ja: プロフィールが正常に更新されました
ko: 프로필이 성공적으로 업데이트되었습니다
ru: Профиль успешно обновлен
zh_hant: 資料更新成功

# welcomeUserTemplate
source: Welcome, {userName}!
ja: ようこそ、{userName}さん！
ko: 환영합니다, {userName}님!
ru: Добро пожаловать, {userName}!
zh_hant: 歡迎，{userName}！

# error_404
source: Resource not found
ja: リソースが見つかりません
ko: 리소스를 찾을 수 없습니다
ru: Ресурс не найден
zh_hant: 資源未找到

# error_500
source: Server error, please try again later
ja: サーバーエラー、後でもう一度お試しください
ko: 서버 오류, 나중에 다시 시도해주세요
ru: Ошибка сервера, попробуйте позже
zh_hant: 服務器錯誤，請稍後再試

# appTitle
source: My App
ja: 私のアプリ
ko: 내 앱
ru: Мое приложение
zh_hant: 我的應用

source: Switch Language
ja: 言語を切り替える
ko: 언어 전환
ru: Переключить язык
zh_hant: 切換語言

# masterGenderMale
source: Male
ja: 男性
ko: 남성
ru: Мужской
zh_hant: 男

# masterGenderFemale
source: Female
ja: 女性
ko: 여성
ru: Женский
zh_hant: 女

# masterGenderUnspecified
source: Unspecified
ja: 指定なし
ko: 지정 안함
ru: Не указано
zh_hant: 未指定

# masterRatingExcellent
source: Excellent
ja: 優秀
ko: 우수
ru: Отлично
zh_hant: 優秀

# masterRatingGood
source: Good
ja: 良い
ko: 좋음
ru: Хорошо
zh_hant: 良好

# masterRatingAverage
source: Average
ja: 普通
ko: 보통
ru: Средне
zh_hant: 一般

# masterRatingPoor
source: Poor
ja: 悪い
ko: 나쁨
ru: Плохо
zh_hant: 較差

# masterRatingVeryPoor
source: Very Poor
ja: とても悪い
ko: 매우 나쁨
ru: Очень плохо
zh_hant: 很差

# masterRatingNoRating
source: No Rating
ja: 評価なし
ko: 평가 없음
ru: Без оценки
zh_hant: 無評分

# masterRequestSlowClear
source: Slow & Clear
ja: ゆっくりはっきり
ko: 천천히 명확하게
ru: Медленно и четко
zh_hant: 慢速清晰

# masterRequestNaturalSpeed
source: Natural Speed
ja: 自然なスピード
ko: 자연스러운 속도
ru: Естественная скорость
zh_hant: 自然語速

# masterRequestStrictTeaching
source: Strict Teaching
ja: 厳格な指導
ko: 엄격한 교육
ru: Строгое обучение
zh_hant: 嚴格教學

# masterRequestFreeConversation
source: Free Conversation
ja: 自由な会話
ko: 자유 대화
ru: Свободная беседа
zh_hant: 自由對話

# masterRequestStrictCurriculum
source: Strict Curriculum
ja: 厳格なカリキュラム
ko: 엄격한 커리큘럼
ru: Строго по программе
zh_hant: 嚴格按課程

# masterCancelByStudent
source: Student Cancellation
ja: 生徒によるキャンセル
ko: 학생 취소
ru: Отменено студентом
zh_hant: 學生取消

# masterCancelByTeacher
source: Teacher Cancellation
ja: 講師によるキャンセル
ko: 교사 취소
ru: Отменено преподавателем
zh_hant: 教師取消

# masterCancelBySystem
source: System Cancellation
ja: システムによるキャンセル
ko: 시스템 취소
ru: Отменено системой
zh_hant: 系統取消

# masterRefundFull
source: Full Refund
ja: 全額返金
ko: 전액 환불
ru: Полный возврат
zh_hant: 全額退款

# masterRefundPartial
source: Partial Refund
ja: 部分返金
ko: 부분 환불
ru: Частичный возврат
zh_hant: 部分退款

# masterRefundNone
source: No Refund
ja: 返金なし
ko: 환불 없음
ru: Без возврата
zh_hant: 無退款

# masterRefundPercentage
source: {percentage}% Refund
ja: {percentage}%返金
ko: {percentage}% 환불
ru: {percentage}% возврат
zh_hant: {percentage}%退款

# masterPointsFree
source: Free Course
ja: 無料レッスン
ko: 무료 수업
ru: Бесплатный урок
zh_hant: 免費課程

# masterPointsEconomical
source: Economical
ja: お得
ko: 경제적
ru: Экономичный
zh_hant: 經濟實惠

# masterPointsStandard
source: Standard Price
ja: 標準価格
ko: 표준 가격
ru: Стандартная цена
zh_hant: 標準價格

# masterPointsPremium
source: Premium Course
ja: プレミアムレッスン
ko: 프리미엄 수업
ru: Премиум урок
zh_hant: 高級課程

# masterLessonShort
source: Short Lesson
ja: 短時間レッスン
ko: 짧은 수업
ru: Короткий урок
zh_hant: 短課程

# masterLessonStandard
source: Standard Lesson
ja: 標準レッスン
ko: 표준 수업
ru: Стандартный урок
zh_hant: 標準課程

# masterLessonLong
source: Long Lesson
ja: 長時間レッスン
ko: 긴 수업
ru: Длинный урок
zh_hant: 長課程

# masterLessonExtraLong
source: Extra Long Lesson
ja: 超長時間レッスン
ko: 매우 긴 수업
ru: Очень длинный урок
zh_hant: 超長課程

source: Help
ja: ヘルプ
ko: 도움말
ru: Помощь
zh_hant: 幫助

# verificationCode
source: Code
ja: 認証コード
ko: 인증 코드
ru: Код подтверждения
zh_hant: 驗證碼

# getVerificationCode
source: Get a Code
ja: 認証コードを取得
ko: 인증 코드를 받아보세요
ru: Получить код подтверждения
zh_hant: 獲取驗證碼

source: Verification Code Invalid
ja: 認証コードが無効です
ko: 인증 코드가 유효하지 않습니다
ru: Неверный код подтверждения
zh_hant: 驗證碼無效

source: Verification Code Expired
ja: 認証コードの有効期限が切れています
ko: 인증 코드가 만료되었습니다
ru: Код подтверждения истек
zh_hant: 驗證碼已過期

# verificationCodeRequired
source: Please enter the code
ja: 認証コードを入力してください
ko: 인증 코드를 입력하세요
ru: Введите код подтверждения
zh_hant: 請輸入驗證碼

# verificationCodeResend
source: Resend verification code
ja: 認証コードを再送信
ko: 인증 코드 재전송
ru: Отправить код повторно
zh_hant: 重新發送驗證碼

# verificationCodeResendSuccess
source: Verification code sent successfully
ja: 認証コードが送信されました、SMSをご確認ください
ko: 인증 코드가 전송되었습니다
ru: Код подтверждения отправлен, проверьте SMS
zh_hant: 驗證碼已發送，請查收短信

# verificationCodeResendFailed
source: Verification code send failed
ja: 認証コードの送信に失敗しました
ko: 인증 코드 전송에 실패했습니다
ru: Не удалось отправить код подтверждения
zh_hant: 驗證碼發送失敗

# verificationCodeResendLimitExceeded
source: Verification code send limit exceeded
ja: 認証コードの送信回数制限に達しました
ko: 인증 코드 전송 한도를 초과했습니다
ru: Превышен лимит отправки кода подтверждения
zh_hant: 驗證碼發送次數已達上限

# verificationCodeResendCooldown
source: Please try again later
ja: しばらくしてから再試行してください
ko: 잠시 후 다시 시도하세요
ru: Попробуйте позже
zh_hant: 請稍後再試

# verificationCodeResendCooldownMessage
source: Please try again in {seconds} seconds.
ja: {seconds}秒後に再試行してください
ko: {seconds}초 후에 다시 시도하세요
ru: Попробуйте через {seconds} секунд
zh_hant: 請 {seconds} 秒後再試

# verificationCodeResendCooldownMessage2
source: Please try again in {minutes} minutes.
ja: {minutes}分後に再試行してください
ko: {minutes}분 후에 다시 시도하세요
ru: Попробуйте через {minutes} минут
zh_hant: 請 {minutes} 分鐘後再試

source: Password
ja: パスワード
ko: 비밀번호
ru: Пароль
zh_hant: 密碼

# passwordConfirm
source: Confirm Password
ja: パスワード確認
ko: 비밀번호 확인
ru: Подтвердите пароль
zh_hant: 確認密碼

# passwordInvalid
source: Password is invalid
ja: パスワードが無効です
ko: 비밀번호가 유효하지 않습니다
ru: Неверный пароль
zh_hant: 密碼無效

# passwordRequired
source: Please enter password
ja: パスワードを入力してください
ko: 비밀번호를 입력하세요
ru: Введите пароль
zh_hant: 請輸入密碼

source: Login
ja: ログイン
ko: 로그인
ru: Войти
zh_hant: 登入

source: Logout
ja: ログアウト
ko: 로그아웃
ru: Выйти
zh_hant: 登出

# register
source: Sign Up
ja: 登録
ko: 회원가입
ru: Регистрация
zh_hant: 注冊

source: Forgot Password?
ja: パスワードをお忘れですか？
ko: 비밀번호 찾기
ru: Забыли пароль?
zh_hant: 忘記密碼?

source: Cancel
ja: キャンセル
ko: 취소
ru: Отмена
zh_hant: 取消

source: Confirm
ja: 確認
ko: 확인
ru: Подтвердить
zh_hant: 確認

source: Agree and Login
ja: 同意してログイン
ko: 동의하고 로그인
ru: Согласиться и войти
zh_hant: 同意並登入

# verificationCodeLogin
source: By SMS Code
ja: 認証コードでログイン
ko: 인증 코드 로그인
ru: Вход по коду
zh_hant: 驗證碼登入

# passwordLogin
source: By Password
ja: パスワードでログイン
ko: 비밀번호 로그인
ru: Вход по паролю
zh_hant: 密碼登入

# unregisteredPhoneWillBeRegisteredAndLoggedInBackup
source: Unregistered phone numbers will be automatically registered and logged in.
ja: 未登録の電話番号は自動的に登録およびログインされます。
ko: 등록되지 않은 전화번호는 등록되고 로그인됩니다
ru: Незарегистрированные номера будут автоматически зарегистрированы и авторизованы
zh_hant: 未註冊的手機號碼將自動註冊並登入

# iHaveReadAndAgree
source: I agree to the
ja: 利用規約とプライバシーポリシーに同意します。
ko: 나는 읽고 동의합니다
ru: Я прочитал и согласен с
zh_hant: 我已閱讀並同意

source: User Agreement
ja: 利用規約
ko: 《用户协议》
ru: Пользовательским соглашением
zh_hant: <用戶協議>

source: and
ja: と
ko: 和
ru: и
zh_hant: 和

source: Privacy Policy
ja: プライバシーポリシー
ko: 《隐私政策》
ru: Политика конфиденциальности
zh_hant: 隱私政策

# pleaseEnterPhoneNumber
source: Please enter your phone number
ja: 電話番号を入力してください
ko: 전화번호를 입력하세요
ru: Введите номер телефона
zh_hant: 請輸入手機號碼

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number.
ja: 有効な電話番号を入力してください。
ko: 유효한 전화번호를 입력해주세요.
ru: Введите действительный номер телефона.
zh_hant: 請輸入有效的手機號碼

source: Please enter email/phone/account
ja: メールアドレス / 電話番号 / ユーザー名
ko: 이메일/계정을 입력하세요
ru: Введите электронную почту/номер телефона/аккаунт
zh_hant: 請輸入電子信箱/手機號碼/帳號

source: Select
ja: 選択
ko: 선택
ru: Выбрать
zh_hant: 選擇

source: Country
ja: 国または地域
ko: 국가
ru: Страна
zh_hant: 國家

source: Or
ja: または
ko: 또는
ru: или
zh_hant: 或

source: District
ja: 地域
ko: 구
ru: Регион
zh_hant: 地區

source: Phone Verification
ja: SMS認証
ko: 전화번호 인증
ru: Подтверждение по телефону
zh_hant: 手機號碼驗證

source: Email Verification
ja: メール認証
ko: 이메일 인증
ru: Подтверждение по электронной почте
zh_hant: 電子郵件驗證

source: Phone Number
ja: 電話番号
ko: 전화번호
ru: Номер телефона
zh_hant: 手機號碼

# email
source: Mail
ja: メールアドレス
ko: 이메일
ru: Электронная почта
zh_hant: 電子郵件

source: New Password
ja: 新しいパスワード
ko: 새 비밀번호
ru: Новый пароль
zh_hant: 新密碼

# confirmNewPassword
source: Confirm Password
ja: パスワードを確認
ko: 새 비밀번호 확인
ru: Подтвердите новый пароль
zh_hant: 確認新密碼

source: Complete and Login
ja: 完了してログイン
ko: 완료하고 로그인
ru: Завершить и войти
zh_hant: 完成並登入

source: Bind Phone
ja: 電話番号を連携
ko: 전화번호 바인딩
ru: Привязать телефон
zh_hant: 綁定手機號碼

source: Bind Account
ja: アカウントを連携
ko: 계정 바인딩
ru: Привязать аккаунт
zh_hant: 綁定帳號

source: Bind and Log in
ja: 連携してログイン
ko: 바인딩하고 로그인
ru: Привязать и войти
zh_hant: 綁定並登入

# registeredEmailOrAccount
source: Registered Email/Account
ja: 登録済みのメールアドレス／アカウント
ko: 등록된 이메일/계정
ru: Зарегистрированная почта/аккаунт
zh_hant: 已註冊的郵箱/帳號

source: Login / Sign Up
ja: ログイン / 登録
ko: 로그인 / 회원가입
ru: Войти / Зарегистрироваться
zh_hant: 登入/註冊

source: Quick login with local number
ja: 電話番号でログイン
ko: 현지 번호로 빠른 로그인
ru: Вход с местным номером
zh_hant: 本機號碼快速登入

source: Use another number / account
ja: 別の電話番号 / アカウントでログイン
ko: 다른 번호 / 계정 사용
ru: Использовать другой номер/аккаунт
zh_hant: 其他手機號碼/帳號登入

# unregisteredPhoneWillBeRegisteredAndLoggedIn
source: Unregistered phone numbers will be automatically registered and logged in.
ja: 未登録の電話番号は自動的に登録およびログインされます。
ko: 등록되지 않은 전화번호는 자동으로 등록되고 로그인됩니다.
ru: Незарегистрированные номера будут автоматически зарегистрированы и авторизованы.
zh_hant: 未註冊的手機號碼將自動註冊並登入

source: By SMS Code
ja: 認証コードでログイン
ko: SMS 코드로
ru: С помощью SMS-кода
zh_hant: 驗證碼登入

source: By Password
ja: パスワードでログイン
ko: 비밀번호로
ru: С помощью пароля
zh_hant: 密碼登入

source: Get a code
ja: コードを取得
ko: 코드 받기
ru: Получить код
zh_hant: 獲取驗證碼

source: Other login methods
ja: 他の方法でログイン
ko: 다른 로그인 방법
ru: Другие способы входа
zh_hant: 其他方式登入

# iAgreeToUserAgreementAndPrivacyPolicy
source: I agree to the User Agreement and Privacy Policy.
ja: 利用規約とプライバシーポリシーに同意します。
ko: 사용자 약관 및 개인정보 보호정책에 동의합니다.
ru: Принимаю Пользовательское соглашение и Политику конфиденциальности.
zh_hant: 我已閱讀並同意<用戶協議>和<隱私政策>

source: Email / Phone number / Username
ja: メールアドレス / 電話番号 / ユーザー名
ko: 이메일 / 전화번호 / 사용자명
ru: Электронная почта / Номер телефона / Имя пользователя
zh_hant: 電子信箱/手機號碼/帳號

source: Sign up with email.
ja: メールアドレスで登録
ko: 이메일로 회원가입.
ru: Регистрация по электронной почте.
zh_hant: 電子信箱註冊

source: Log In
ja: ログイン
ko: 로그인
ru: Войти
zh_hant: 登入

# passwordsMustBe8To20Characters
source: Passwords must be 8-20 characters long and contain at least one number, one letter, and one special character.
ja: パスワードは8～20文字で、数字・英字・記号をすべて含めてください。
ko: 비밀번호는 8-20자이며 숫자, 문자, 특수문자를 모두 포함해야 합니다.
ru: Пароль должен быть длиной от 8 до 20 символов и содержать как минимум одну цифру, одну букву и один специальный символ.
zh_hant: 密碼規則為8-20位，且需要同時包含數字、字母、特殊符號

source: Agree and log in
ja: 同意してログイン
ko: 동의하고 로그인
ru: Подтвердить и войти
zh_hant: 同意並登入

source: Complete and log in
ja: 完了してログイン
ko: 완료하고 로그인
ru: Заполнить и войти
zh_hant: 完成並登入

source: Bind and log in
ja: 連携してログイン
ko: 연결하고 로그인
ru: Привязать и войти
zh_hant: 綁定並登入

source: SMS Verification
ja: SMS認証
ko: SMS 인증
ru: Подтверждение по SMS
zh_hant: 手機號碼驗證

source: Email address
ja: メールアドレス
ko: 이메일 주소
ru: Адрес электронной почты
zh_hant: 電子郵件

source: Bind Phone Number
ja: 電話番号を連携
ko: 전화번호 연결
ru: Привязать номер телефона
zh_hant: 綁定手機號碼

source: Sign Up
ja: 新規登録
ko: 회원가입
ru: Регистрация
zh_hant: 註冊

source: Sign Up and Log In
ja: 登録してログイン
ko: 회원가입하고 로그인
ru: Регистрация и вход
zh_hant: 註冊並登入

source: Select an account to enter
ja: アカウントを選択してください
ko: 입장할 계정을 선택하세요
ru: Выберите аккаунт для входа
zh_hant: 選擇需要進入的帳號

# isLinkedToMultipleAccounts
source: {userAccount} is linked to multiple accounts. You may access any of the following accounts:
ja: {userAccount} は複数のアカウントに連携されています。以下のいずれかのアカウントにアクセスできます：
ko: 이(가) 여러 계정에 연결되어 있습니다. 다음 계정 중 하나에 액세스할 수 있습니다:
ru: {userAccount} привязан к нескольким аккаунтам. Вы можете войти в любой из них.
zh_hant: {userAccount} 已綁定多個帳號，您可進入以下任一帳號

source: Select an account to reset password
ja: パスワードをリセットするアカウントを選択
ko: 비밀번호를 재설정할 계정을 선택하세요
ru: Выберите учётную запись для сброса пароля
zh_hant: 選擇需要重新設定密碼的帳號

# isAssociatedWithMultipleAccountsResetPassword
source: {userAccount} is associated with multiple accounts. Select one to reset its password. After resetting, log in using the new password.
ja: {userAccount} は複数のアカウントに連携されています。いずれかを選んでパスワードをリセットしてください。リセット後は新しいパスワードでログインしてください。
ko: 이(가) 여러 계정과 연결되어 있습니다. 비밀번호를 재설정할 계정을 선택하세요. 재설정 후 새 비밀번호로 로그인하세요.
ru: {userAccount} привязан к нескольким аккаунтам. Выберите один для сброса пароля. Затем войдите с новым паролем.
zh_hant: {userAccount} 已綁定多個帳號，可點擊任一帳號設定新密碼。設定成功後，需要使用新密碼登入該帳號。

source: Select an account to link with WeChat
ja: WeChatと連携するアカウントを選択
ko: WeChat과 연결할 계정을 선택하세요
ru: Выберите аккаунт, для которого требуется привязка к WeChat
zh_hant: 選擇需要微信綁定的帳號

# isLinkedToMultipleAccountsWeChat
source: {userAccount} is linked to multiple accounts. Select one to connect to WeChat. Once linked, you may log in using WeChat.
ja: {userAccount} は複数のアカウントに連携されています。いずれかを選んでWeChatと連携してください。連携後、WeChatでログインできます。
ko: 이(가) 여러 계정에 연결되어 있습니다. WeChat과 연결할 계정을 선택하세요. 연결 후 WeChat으로 로그인할 수 있습니다.
ru: {userAccount} привязан к нескольким аккаунтам. Нажмите на любой, чтобы привязать WeChat. После этого сможете входить через WeChat.
zh_hant: {userAccount} 已綁定多個帳號，可點擊任一帳號綁定微信。設定成功後，您可使用微信登入該帳號。

source: Enter
ja: 進む
ko: 입장
ru: Войти
zh_hant: 進入

source: Recently used
ja: 前回使用
ko: 최근 사용
ru: Недавно использовано
zh_hant: 上次

source: Select Your Country or Region
ja: 国または地域を選択
ko: 국가 또는 지역을 선택하세요
ru: Выберите страну или регион
zh_hant: 選擇國家和地區

source: Reminder
ja: お知らせ
ko: 알림
ru: Напоминание
zh_hant: 溫馨提示

# pleaseReadAndAgreeToUserAgreementAndPrivacyPolicyFirst
source: Please read and agree to the <User Agreement> and <Privacy Policy> first.
ko: 먼저 <사용자 약관>과 <개인정보 보호정책>을 읽고 동의해주세요.
ru: Сначала прочтите и примите <Пользовательское соглашение> и <Политику конфиденциальности>.

# welcomeToCampusTopPrivacyPolicy
source: Welcome to CampusTop! We recognize the importance of your personal information and value your trust. To protect your rights and comply with applicable regulations, our Privacy Policy explains how we collect, store, secure, use, and disclose your data, along with your legal rights. For complete details, please review the full CampusTop Privacy Policy.
ja: ようこそ、CampusTopへ！ 当社はお客様の個人情報の重要性を認識し、その保護に努めています。 プライバシーポリシーでは、情報の収集、保存、安全性、利用、開示の方法およびお客様の法的権利について説明しています。 詳細はCampusTopのプライバシーポリシー全文をご確認ください。
ko: CampusTop에 오신 것을 환영합니다! 저희는 귀하의 개인정보의 중요성을 인식하고 귀하의 신뢰를 소중히 여깁니다. 귀하의 권리를 보호하고 관련 규정을 준수하기 위해, 저희 개인정보 보호정책은 저희가 귀하의 데이터를 수집, 저장, 보안, 사용 및 공개하는 방법과 귀하의 법적 권리에 대해 설명합니다. 자세한 내용은 CampusTop 개인정보 보호정책 전문을 검토해주세요.
ru: Добро пожаловать в CampusTop! Мы высоко ценим вашу личную информацию и конфиденциальность. Для предоставления вам более качественного обслуживания мы можем собирать и использовать необходимую информацию — вы имеете право отказаться от этого. Прежде чем пользоваться услугами CampusTop, пожалуйста, внимательно ознакомьтесь с Пользовательским соглашением и Политикой конфиденциальности и полностью изучите их содержание. Мы будем строго соблюдать эти правила использования и защиты ваших персональных данных и стремимся предоставлять вам наилучший сервис. Благодарим вас за доверие. Если вы согласны продолжить использование продуктов или услуг CampusTop, нажмите кнопку «Согласен».
zh_hant: 歡迎來到 CampusTop！ 我們非常重視您的個人資訊與隱私保護。為了向您提供更好的服務，我們會收集、使用必要的資訊，您有權選擇拒絕。 在您使用 CampusTop 服務之前，請務必審慎閱讀《使用者協議》與《隱私權政策》，並充分理解政策內容。我們將嚴格依照政策內容使用並保護您的個人資訊，致力於為您提供更優質的服務，感謝您的信任。 若您繼續使用 CampusTop 的產品或服務，請點擊同意按鈕。

source: Agree and Continue
ja: 同意して続ける
ko: 동의하고 계속
ru: Принять и продолжить
zh_hant: 同意並繼續

source: Disagree
ja: 同意しない
ko: 동의하지 않음
ru: Не согласиться
zh_hant: 不同意

source: Complete Your Information
ja: 情報を入力する
ko: 정보를 완성하세요
ru: Заполните информацию
zh_hant: 完善資料

source: Male
ja: 男性
ko: 남성
ru: Мужской
zh_hant: 男生

source: Female
ja: 女性
ko: 여성
ru: Женский
zh_hant: 女生

source: Date of birth
ja: 生年月日
ko: 생년월일
ru: Дата рождения
zh_hant: 生日

source: Full name
ja: 氏名
ko: 전체 이름
ru: Полное имя
zh_hant: 姓名

source: English nickname
ja: ニックネーム
ko: 영어 닉네임
ru: Псевдоним на английском
zh_hant: 英文暱稱

source: Recommended English name
ja: おすすめのニックネーム
ko: 추천 영어 이름
ru: Рекомендуемое английское имя
zh_hant: 推薦英文名

source: Refresh
ja: 更新
ko: 새로고침
ru: Обновить
zh_hant: 換一換

source: Select Birthday
ja: 誕生日を選択
ko: 생일 선택
ru: Выберите дату рождения
zh_hant: 選擇生日

source: Select Language
ja: 言語を選択
ko: 언어 선택
ru: Выберите язык
zh_hant: 選擇語言

source: Upload from Album
ja: アルバムからアップロード
ko: 앨범에서 업로드
ru: Загрузить из альбома
zh_hant: 從相簿上傳

source: Take Photo
ja: 写真を撮る
ko: 사진 촬영
ru: Сделать фото
zh_hant: 拍照

source: Scan QR Code
ja: QRコードをスキャン
ko: QR 코드 스캔
ru: Сканировать QR-код
zh_hant: 掃描QRcode

# pleaseAlignQRCodeWithinCenter
source: Please align the QR code within the center of the frame.
ja: QRコードを枠の中央に合わせてください。
ko: QR 코드를 프레임 중앙에 맞춰주세요.
ru: Пожалуйста, выровняйте QR-код по центру рамки.
zh_hant: 請將QRcode對準掃描框中心

source: Scan to Log In
ja: スキャンしてログイン
ko: 스캔하여 로그인
ru: Сканируйте для входа
zh_hant: 掃描登入

# pleaseConfirmItsYouAndEnsureQRCodeSourceIsSafe
source: Please confirm it's you and ensure the QR code source is safe.
ja: ご本人確認のうえ、安全なQRコードであることをご確認ください。
ko: 본인임을 확인하고 QR 코드 소스가 안전한지 확인해주세요.
ru: Подтвердите, что это вы, и убедитесь, что источник QR-кода безопасен.
zh_hant: 請確認是本人操作並確保QRcode來源安全

source: Account is logged in on another device
ja: アカウント は別の端末でログイン中
ko: 계정이 다른 기기에서 로그인되어 있습니다
ru: Учётная запись выполнена на другом устройстве
zh_hant: 帳號在其他設備登入

source: Confirm Login
ja: ログインを確認
ko: 로그인 확인
ru: Подтвердить вход
zh_hant: 確認登入

source: Cancel Login
ja: ログインをキャンセル
ko: 로그인 취소
ru: Отменить вход
zh_hant: 取消登入

# followingContentNotProvidedByCampusTop
source: The following content is not provided by CampusTop, please use with caution.
ja: 以下のコンテンツはCampusTopが提供するものではありません。ご注意のうえご利用ください。
ko: 다음 콘텐츠는 CampusTop에서 제공하지 않으므로 주의해서 사용하세요.
ru: Следующий контент не предоставлен CampusTop, используйте его с осторожностью.
zh_hant: 以下內容非CampusTop提供，請謹慎使用

source: Open in browser
ja: ブラウザで開く
ko: 브라우저에서 열기
ru: Открыть в браузере
zh_hant: 瀏覽器打開

source: CampusTop Web Version
ja: CampusTop Web版
ko: CampusTop 웹 버전
ru: Веб-версия CampusTop
zh_hant: CampusTop 網頁端

# twoPasswordEntriesDoNotMatch
source: The two password entries do not match.
ja: パスワードが一致しません。
ko: 두 비밀번호 입력이 일치하지 않습니다.
ru: Два введенных пароля не совпадают.
zh_hant: 兩次密碼輸入不一致

source: Reset Password
ja: パスワードをリセット
ko: 비밀번호 재설정
ru: Сбросить пароль
zh_hant: 重設密碼

source: Please enter your phone number.
ja: 電話番号を入力してください。
ko: 전화번호를 입력해주세요.
ru: Введите свой номер телефона.
zh_hant: 請輸入手機號碼

source: Phone number not registered, please re-enter.
ja: 電話番号が登録されていません。再入力してください。
ko: 전화번호가 등록되지 않았습니다. 다시 입력해주세요.
ru: Номер телефона не зарегистрирован, пожалуйста, введите другой.
zh_hant: 手機號碼未註冊，請重新輸入

source: Please enter your email address.
ja: メールアドレスを入力してください。
ko: 이메일 주소를 입력해주세요.
ru: Введите свой адрес электронной почты.
zh_hant: 請輸入電子信箱

# pleaseEnterValidEmailAddress
source: Please enter a valid email address.
ja: 有効なメールアドレスを入力してください。
ko: 유효한 이메일 주소를 입력해주세요.
ru: Введите действительный адрес электронной почты.
zh_hant: 請輸入有效的電子信箱

source: Email not registered. Please re-enter.
ja: メールアドレスが登録されていません。再入力してください。
ko: 이메일이 등록되지 않았습니다. 다시 입력해주세요.
ru: Электронная почта не найдена. Введите другую.
zh_hant: 電子信箱未註冊，請重新輸入

# thisEmailHasAlreadyBeenRegistered
source: This email has already been registered. Please log in directly.
ja: このメールアドレスはすでに登録されています。ログインしてください。
ko: 이 이메일은 이미 등록되었습니다. 직접 로그인해주세요.
ru: Эта почта уже зарегистрирована. Войдите в аккаунт.
zh_hant: 電子信箱已被註冊，請直接登入

# tooManyAttemptsPleaseRetryIn5Minutes
source: Too many attempts. Please try again in 5 minutes.
ja: 5分後に再試行してください。
ko: 너무 많은 시도입니다. 5분 후에 다시 시도해주세요.
ru: Слишком много попыток. Попробуйте снова через 5 минут.
zh_hant: 操作過於頻繁，請5分鐘後再試

# smsCodeRequestLimitReached
source: SMS code request limit reached. Please try again tomorrow.
ja: SMSコードのリクエスト上限に達しました。明日再試行してください。
ko: SMS 코드 요청 한도에 도달했습니다. 내일 다시 시도해주세요.
ru: Достигнут лимит запросов SMS-кода. Повторите попытку завтра.
zh_hant: 驗證碼發送已達上限，請明天再試

# phoneNumberDoesNotMatchSelectedRegion
source: The phone number does not match the selected region.
ja: 選択した地域と電話番号が一致しません。
ko: 전화번호가 선택한 지역과 일치하지 않습니다.
ru: Номер телефона не соответствует выбранному региону.
zh_hant: 手機號碼與地區不匹配

# incorrectVerificationCodePleaseRetry
source: Incorrect verification code. Please try again.
ja: 認証コードが正しくありません。再入力してください。
ko: 잘못된 인증 코드입니다. 다시 시도해주세요.
ru: Неверный код подтверждения. Повторите попытку.
zh_hant: 驗證碼錯誤，請重新輸入

# phoneNumberAlreadyLinkedToAnotherWeChat
source: This phone number is already linked to another WeChat account. Please contact customer service.
ja: この電話番号はすでに別のWeChatアカウントに連携されています。カスタマーサポートにお問い合わせください。
ko: 이 전화번호는 이미 다른 WeChat 계정에 연결되어 있습니다. 고객 서비스에 문의해주세요.
ru: Номер уже привязан к другому аккаунту WeChat. Обратитесь в поддержку.
zh_hant: 該手機號碼已綁定其他微信，請聯絡客服

source: Account not registered. Please re-enter.
ja: アカウントが登録されていません。再入力してください。
ko: 계정이 등록되지 않았습니다. 다시 입력해주세요.
ru: Аккаунт не зарегистрирован. Попробуйте снова.
zh_hant: 帳號未註冊，請重新輸入

# incorrectPasswordPleaseRetry
source: Incorrect password. Please try again.
ja: パスワードが間違っています。再入力してください。
ko: 잘못된 비밀번호입니다. 다시 시도해주세요.
ru: Неверный пароль. Повторите попытку.
zh_hant: 密碼錯誤，請重新輸入

# tooManyIncorrectAttemptsPleaseRetryIn5Minutes
source: Too many incorrect attempts. Please try again in 5 minutes.
ja: 5分後に再試行してください。
ko: 너무 많은 잘못된 시도입니다. 5분 후에 다시 시도해주세요.
ru: Слишком много неверных попыток. Повторите попытку через 5 минут.
zh_hant: 密碼輸錯次數過多，請5分鐘後再試
